In [6]:
import pandas as pd
import numpy as np

### 판다스 데이터 입출력
판다스는 아래와 같은 형식의 데이터를 입력받아 데이터프레임을 만들 수 있음
- CSV
- Excel
- HTML
- JSON
- HDF5
- SAS
- STATA
- SQL
  
가장 많이 사용되는 포멧은 CSV, JSON, SQL

### `%%writefile` 명령
`%%writefile` 명령어를 사용하여 파이썬에서 파일을 생성할 수 있음

In [7]:
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample1.csv

### csv 파일 입력
판다스 패키지의 `read_csv` 메서드를 사용하여 로컬에 존재하는 CSV 파일을 읽을 수 있음

In [8]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

만약 데이터에 열 인덱스가 존재하지 않는다면 `read_csv` 메서드의 `names` 속성으로 열 인덱스를 지정할 수 있음

In [9]:
%%writefile sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample2.csv

In [10]:
pd.read_csv('sample2.csv', names=['c1','c2','c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

CSV의 특정 열을 행 인덱스로 사용하고 싶을 땐 `read_csv` 메서드의 `index_col` 속성으로 지정할 수 있음

In [11]:
pd.read_csv('sample1.csv', index_col = 'c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

특정한 값을 `NaN`으로 변경하고 싶으면 `na_values` 속성으로 `NaN`으로 취급할 값을 리스트로 지정함

In [12]:
%%writefile sample3.csv
c1,c2,c3
1, 1.11, one
2, , two
누락, 3.33, three

Overwriting sample3.csv

In [19]:
df = pd.read_csv('sample3.csv', na_values = ['누락', ' '])
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

### DataFrame을 CSV 파일로 출력
`to_csv()` 메서드로 데이터프레임을 csv 파일로 출력할 수 있음

In [17]:
df.to_csv('sample4.csv')

In [20]:
!type sample4.csv

,c1,c2,c3
0,1.0,1.11, one
1,2.0,, two
2,,3.33, three

파일을 출력할 때 구분자를 변경하고 싶으면 `sep` 속성에 구분자를 지정함

In [21]:
df.to_csv('sample5.csv', sep = '_')

`NaN` 값에 대해서 표시를 변경하고 싶으면 `np_rap` 속성에 표시할 값을 지정함

In [22]:
df.to_csv('sample6.csv', na_rep= '누락')

`index`, `header` 속성으로 행 인덱스 및 열 인덱스의 출력 여부를 지정함

In [23]:
df.to_csv('sample7.csv', index= False, header= False)

### 인터넷 상의 CSV 파일 입력
로컬에 존재하는 csv 파일 뿐만 아니라 웹 상에 존재하는 csv 파일도 `read_csv()` 메서드를 읽을 수 있음

In [27]:
df = pd.read_csv('https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv')

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
df.tail(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### 데이터베이스 입력
데이터베이스에 있는 데이터를 데이터프레임으로 받아오기 위해서는 각 DBMS에 맞는 connector를 사용하여야 함  
  
##### mysql connector 사용방법
```bash
pip install mysql-connector-python
```  
``` python
import mysql.connector
```

In [1]:
import mysql.connector

In [2]:
try :
    conn = mysql.connector.connect(
        host = '127.0.0.1',
        user = 'root',
        password = 'root',
        database = 'real_estate'
    )
    if conn.is_connected():
        print('데이터베이스 연결 성공')
        
except Exception as e:
    print('데이터베이스 연결 실패',e)

finally :
    if conn.is_connected():
        conn.close()
        print('데이터베이스 연결 해제')

데이터베이스 연결 성공
데이터베이스 연결 해제

데이터베이스 연결 후 쿼리 작업을 할 때는 `cursor` 객체를 사용

In [ ]:
try :
    conn = mysql.connector.connect(
        host = '127.0.0.1',
        user = 'root',
        password = 'root',
        database = 'real_estate'
    )
    if conn.is_connected():
        cursor = conn.cursor()
        query = "SELECT * FROM user"
        cursor.execute(query)

        for record in cursor:
            print(record)
        
except Exception as e:
    print('데이터베이스 연결 실패',e)

finally :
    if conn.is_connected():
        conn.close()
        print('데이터베이스 연결 해제')